app/controllers/movies_controller.rb

	def index

		logger.info "--PARAMS = #{params}"
		@movies = Movie.select("*")

		##sort ascending per title or release_date
		@decor_title = nil
		@decor_release_date = nil
		if !params[:sorted_by].nil?
			instance_variable_set("@decor_#{params[:sorted_by]}", "hilite")
			@movies = @movies.order("#{params[:sorted_by]} ASC")
		end

		##restrict to selected ratings
		@box_states = Hash.new(0)
		@all_ratings = Movie.ratings_uniq_get
		@all_ratings.each{|r| @box_states[r]=1}
---
SELECT * FROM "movies" WHERE (rating = '#<Movie:0xb6d6a630>' OR rating = '#<Movie:0xb6d6a93c>' OR rating = '#<Movie:0xb6d6ac70>' OR rating = '#<Movie:0xb6d6af7c>')
SELECT DISTINCT(rating) FROM "movies" ORDER BY rating ASC